In [ ]:
import pandas as pd
train_df = pd.read_csv("train.csv", encoding="utf-8")
train_df

In [ ]:
test_df = pd.read_csv("test.csv", encoding="utf-8")
test_df

In [8]:
s = train_df.isna().sum()
# filter: 帶入跟資料大小依樣的true/false, true:留 false:滾
s[s > 0].sort_values(ascending=False)

Cabin       687
Age         177
Embarked      2
dtype: int64

In [9]:
s = test_df.isna().sum()
# filter: 帶入跟資料大小依樣的true/false, true:留 false:滾
s[s > 0].sort_values(ascending=False)

Cabin    327
Age       86
Fare       1
dtype: int64

In [12]:
# 數值類型: 中位數
med = train_df.median()
med = med.drop(["Pclass"])
train_df = train_df.fillna(med)
test_df = test_df.fillna(med)

In [17]:
# 類別類型: 最常出現
counts = train_df["Embarked"].value_counts()
most = counts.idxmax()
train_df["Embarked"] = train_df["Embarked"].fillna(most)

In [24]:
n = "Braund, Mr. Owen Harris"
n = n.split(",")[-1].split(".")[0]
n.strip()

'Mr'

In [45]:
import re
n = "Braund, Mr. Owen Harris"
# \w: A~Z a-z \s: blank +:>=1 *:>=0
# \w+: Braund: 一個以上a-z
# \s*: 零個以上的空白
# (\w+): Mr, ()是指這是我的target
# \.: .是有特殊用途的, 所以我\.: 就是.
# [\s\w]+:  Owen Harris \s or \w 出現一次以上
# group: 找出()
pat = r"\w+,\s*(\w+)\.[\s\w]+"
re.search(pat, n).group(1)

'Mr'

In [ ]:
def namecut(n):
    reserved = ["Mr", "Miss", "Mrs", "Master"]
    n = n.split(",")[-1].split(".")[0]
    n = n.strip()
    if n in reserved:
        return n
train_df["Name"] = train_df["Name"].apply(namecut)
train_df["Name"]

In [51]:
test_df["Name"] = test_df["Name"].apply(namecut)

In [53]:
x_train = train_df.drop(["PassengerId", "Survived", "Ticket", "Cabin"],
                        axis=1)
y_train = train_df["Survived"]
x_test = test_df.drop(["PassengerId", "Ticket", "Cabin"],
                      axis=1)

In [54]:
x_train

     Pclass  Name     Sex   Age  SibSp  Parch     Fare Embarked
0         3    Mr    male  22.0      1      0   7.2500        S
1         1   Mrs  female  38.0      1      0  71.2833        C
2         3  Miss  female  26.0      0      0   7.9250        S
3         1   Mrs  female  35.0      1      0  53.1000        S
4         3    Mr    male  35.0      0      0   8.0500        S
..      ...   ...     ...   ...    ...    ...      ...      ...
886       2  None    male  27.0      0      0  13.0000        S
887       1  Miss  female  19.0      0      0  30.0000        S
888       3  Miss  female  28.0      1      2  23.4500        S
889       1    Mr    male  26.0      0      0  30.0000        C
890       3    Mr    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [56]:
# Step2. One-Hot
x_train = pd.get_dummies(x_train)
x_train

     Pclass   Age  SibSp  Parch  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0         3  22.0      1      0  ...         1           0           0           1
1         1  38.0      1      0  ...         0           1           0           0
2         3  26.0      0      0  ...         0           0           0           1
3         1  35.0      1      0  ...         0           0           0           1
4         3  35.0      0      0  ...         1           0           0           1
..      ...   ...    ...    ...  ...       ...         ...         ...         ...
886       2  27.0      0      0  ...         1           0           0           1
887       1  19.0      0      0  ...         0           0           0           1
888       3  28.0      1      2  ...         0           0           0           1
889       1  26.0      0      0  ...         1           1           0           0
890       3  32.0      0      0  ...         1           0           1           0

[891 rows x 14 columns]

In [57]:
x_test = pd.get_dummies(x_test)
x_test

     Pclass   Age  SibSp  Parch  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0         3  34.5      0      0  ...         1           0           1           0
1         3  47.0      1      0  ...         0           0           0           1
2         2  62.0      0      0  ...         1           0           1           0
3         3  27.0      0      0  ...         1           0           0           1
4         3  22.0      1      1  ...         0           0           0           1
..      ...   ...    ...    ...  ...       ...         ...         ...         ...
413       3  28.0      0      0  ...         1           0           0           1
414       1  39.0      0      0  ...         0           1           0           0
415       3  38.5      0      0  ...         1           0           0           1
416       3  28.0      0      0  ...         1           0           0           1
417       3  28.0      1      1  ...         1           1           0           0

[418 rows x 14 columns]